hans-jorg/stm32f746g/X30-Ethernet/eth.c
/**
 * @file    eth.c
 *
 * @note    ETH interface low level routines
 *
 *
 * @date    10/05/2021
 * @author  Hans
 *
 */


#include <stdarg.h>
#include <stdio.h>

#include "stm32f746xx.h"
#include "system_stm32f746.h"
#include "gpio.h"
#include "eth.h"

#include "debugmessages.h"

/**
 * @brief   Which routine to use for configuring pin
 */
//#define ETH_USEGPIOFORCONFIGURATION     1




/**
 * @brief   Round macro. It returns a value equal or greater than N, that is
 *          a multiple of M.
 * 
 * @param   N: value to be rounded
 * @param   M: rounding parameter, typically, sizeof(type)
 */

#define ROUND(N,M)  ( ( ((N)+(M)-1)/(M) )*(M) )


/**
 * Function prototypes (forward referenced);
 */
static void ETH_FlushTXFIFO(void);
static void ETH_UpdateConfigStatus(void);
static void ETH_ManualConfig(void);


/**
 * @brief   Network configuration
 * 
 * @note    AUTONEGOTIATE overrides the other parameters
 *          When Auto Negotiation does not work, use remaining parameters
 */
///@{
#define ETH_CONFIG_AUTONEGOTIATE (1)
#define ETH_CONFIG_100BASET      (2)
#define ETH_CONFIG_10BASET       (4)
#define ETH_CONFIG_FULLDUPLEX    (8)
#define ETH_CONFIG_HALFDUPLEX    (16)
///@}
static const uint32_t ETH_Config =   0 // ETH_CONFIG_AUTONEGOTIATE
// Parameters below only used when Auto Negotiation does not work or not set
                                    |ETH_CONFIG_100BASET
                                    |ETH_CONFIG_FULLDUPLEX;

/**
 * @brief   Ethernet controller status
 */
///@{
#define ETH_STATE_RESET         (0)
#define ETH_STATE_ERROR         (1)
#define ETH_STATE_READY         (2)

static uint32_t ETH_State = ETH_STATE_RESET;
///@}

/**
 * @brief   Ethernet status
 */
///@{

#define ETH_CONFIGSTATUS_LINKDOWN     (1)
#define ETH_CONFIGSTATUS_LINKUP       (2)
#define ETH_CONFIGSTATUS_100BASET     (4)
#define ETH_CONFIGSTATUS_10BASET      (8)
#define ETH_CONFIGSTATUS_FULLDUPLEX   (16)
#define ETH_CONFIGSTATUS_HALFDUPLEX   (32)

static uint32_t ETH_ConfigStatus = ETH_CONFIGSTATUS_LINKDOWN;
///@}


// 48 bit MAC address (must have 12 hexadecimal digits))
#ifndef ETH_MACADDRESS
#define ETH_MACADDRESS 0x2cf05e0bbabdL
#endif


/**
 * @brief   Timing parameters
 * 
 */
///@{
#define ETH_DELAY_AFTERREGISTERWRITE    1000
#define ETH_DELAY_AFTERFLUSH            10
#define ETH_DELAY_AFTERMAC              10
#define ETH_DELAY_AFTERRESET            1000
#define ETH_DELAY_AFTERAUTONEGOTIATION  1000
#define ETH_DELAY_AFTERCONFIG           1000
#define ETH_DELAY_BETWEENTESTS          1000
///@}

/**
 * @brief   Timeout configuration
 */
///@{
#define ETH_RETRIES_AUTONEGOTIATION     100
#define ETH_RETRIES_LINK                1000
//@}
/**
 * @brief   ETH IRQ Configuration
 */

#define ETH_IRQLevel                            (5)

/**
 * @brief   RX and TX descriptors
 * 
 * @note    All sizes are rounded to uint32_t sizes, i.e. multiple of 4.
 */
///@{
#define ETH_TXBUFFERSIZE_INT32UNITS ROUND(ETH_TXBUFFER_SIZE,sizeof(uint32_t))
#define ETH_RXBUFFERSIZE_INT32UNITS ROUND(ETH_RXBUFFER_SIZE,sizeof(uint32_t))
#define ETH_TXBUFFERSIZE_INT8UNITS (ETH_TXBUFFERSIZE_INT32UNITS*sizeof(uint32_t))
#define ETH_RXBUFFERSIZE_INT8UNITS (ETH_RXBUFFERSIZE_INT32UNITS*sizeof(uint32_t))

// where to allocate
#define EXTRAM     __attribute__ ((section(".sdram")))
//#define EXTRAM
    
#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    // These pointers must be initialized thru a call to ETH_SetBuffers
    // They must be in a non cacheable area
    ETH_DMADescriptor               *ETH_TXDescriptors = 0;
    ETH_DMADescriptor               *ETH_RXDescriptors = 0;
    static uint32_t                 *ETH_Area;
    static uint8_t                  *txbuffer = 0;
    static uint8_t                  *rxbuffer = 0;
#else 
    EXTRAM static ETH_DMADescriptor  ETH_TXDesc[ETH_TXBUFFER_COUNT] = { 0 };
    EXTRAM static ETH_DMADescriptor  ETH_RXDesc[ETH_RXBUFFER_COUNT] = { 0 };
    ETH_DMADescriptor               *ETH_TXDescriptors = ETH_TXDesc;
    ETH_DMADescriptor               *ETH_RXDescriptors = ETH_RXDesc;
// An alternative is to define them as an array of 32-bit integers for alignment
#define TXBUFFERSIZE (ETH_TXBUFFERSIZE_INT8UNITS*ETH_TXBUFFER_COUNT)
#define RXBUFFERSIZE (ETH_RXBUFFERSIZE_INT8UNITS*ETH_RXBUFFER_COUNT)

    EXTRAM static uint8_t          txbuffer[TXBUFFERSIZE] 
                                   __attribute((aligned(sizeof(uint32_t))));
    EXTRAM static uint8_t          rxbuffer[RXBUFFERSIZE]
                                   __attribute((aligned(sizeof(uint32_t))));
#endif

///@}

/**
 * @brief   Callbacks
 */
struct ETH_Callbacks_s ETH_Callbacks       = {0};

/**
 * @brief   Symbols for fields in the DMA descriptors
 */

///@{
// This bit is the highest order of word 0 of both descriptors
#define ETH_TXDESC_OWN                   (1<<31)
#define ETH_RXDESC_OWN                   (1<<31)

//** For TX Descriptors **
// These fields are in word 0
#define ETH_TXDESC_CHAINED               (1<<20)
#define ETH_TXDESC_ENDOFRING             (1<<21)
#define ETH_TXDESC_CIC                   (3<<22)
#define ETH_TXDESC_FIRST                 (1<<28)
#define ETH_TXDESC_LAST                  (1<<29)
#define ETH_TXDESC_BUFFER1SIZE_MSK       (0x1FFF)
#define ETH_TXDESC_BUFFER2SIZE_MSK       (0x1FFF0000)


//** For RX Descriptors **
// These fields are in Status word (0)
#define ETH_RXDESC_FRAMELENGTH_POS       (16)
#define ETH_RXDESC_FRAMELENGTH_MASK      (0x3FFF0000)
#define ETH_RXDESC_ERROR_SUMMARY         (1<<15)
#define ETH_RXDESC_ERROR_DESCRIPTOR      (1<<14)
#define ETH_RXDESC_ERROR_LENGTH          (1<<12)
#define ETH_RXDESC_ERROR_OVERFLOW        (1<<10)
#define ETH_RXDESC_FIRST                 (1<<9)
#define ETH_RXDESC_LAST                  (1<<8)
#define ETH_RXDESC_ERROR_RECEIVE         (1<<3)
#define ETH_RXDESC_ERROR_CRC             (1<<1)
// These fields are in ControlBufferSize word (1)
#define ETH_RXDESC_BUFFER1SIZE_MASK      (0x1FFF)
#define ETH_RXDESC_BUFFER1SIZE_POS       (0)
#define ETH_RXDESC_BUFFER2SIZE_MASK      (0x1FFF0000)
#define ETH_RXDESC_BUFFER2SIZE_POS       (16)
#define ETH_RXDESC_ENDOFRING             (1<<15)
#define ETH_RXDESC_CHAINED               (1<<14)
#define ETH_RXBUFFER_DIC                 (1<<31)

///@}

/**
 * @brief   Defines for configure PHY
 *
 * @note LAN8742 PHY register description
 *
 *|  # |        | Description                                |  Group          |
 *|----|--------|--------------------------------------------|-----------------|
 *|  0 | BCR    | Basic Control Register                     | Basic           |
 *|  1 | BSR    | Basic Status Register                      | Basic           |
 *|  2 | ID1R   | PHY Identifier 1 Register                  | Extended        |
 *|  3 | ID2R   | PHY Identifier 2 Register                  | Extended        |
 *|  4 | ANAR   | Auto Negotiation Advertisement Register    | Extended        |
 *|  5 | ANLPR  | Auto Negotiation Link Partner Register     | Extended        |
 *|  6 | ANEPR  | Auto Negotiation Expansion Register        | Extended        |
 *|  7 | ANNPTXR| Auto Negotiation Next Page TX Register     | Extended        |
 *|  8 | ANNPRXR| Auto Negotiation Next Page RX Register     | Extended        |
 *| 13 | MMDACR | MMD Access Control Register                | Extended        |
 *| 14 | MMADR  | MMD Access Address/Data Register           | Extended        |
 *| 16 | EDPDR  | EDPD NLP/Crossover TimeRegister            | Vendor-specific |
 *| 17 | MCSR   | Mode Control/Status Register               | Vendor-specific |
 *| 18 | SMR    | Special Modes Register                     | Vendor-specific |
 *| 24 | TDRPDR | TDR Patterns/Delay Control Register        | Vendor-specific |
 *| 25 | TDCSR  | TDR Control/Status Register                | Vendor-specific |
 *| 26 | SECR   | Symbol Error Counter Register              | Vendor-specific |
 *| 27 | SCSIR  | Special Control/Status Indications Register| Vendor-specific |
 *| 28 | CLR    | Cable Length Register                      | Vendor-specific |
 *| 29 | ISFR   | Interrupt Source Flag Register             | Vendor-specific |
 *| 30 | IMR    | Interrupt Mask Register                    | Vendor-specific |
 *| 31 | SCSR   | PHY Special Control/Status Register        | Vendor-specific |
 * 
 * 
 */

/** PHY */
#define ETH_PHY_ADDRESS                         (0)

/** Registers */
///@{
#define ETH_PHY_BCR                             (0)
#define ETH_PHY_BSR                             (1)
#define ETH_PHY_ISFR                           (29)
#define ETH_PHY_IMR                            (30)
#define ETH_PHY_ANA                             (4)
#define ETH_PHY_SCSR                           (31)
///@}


