hans-jorg/stm32f746g/X30-Ethernet/eth.c
/** Fields of BCR Register */
///@{
#define ETH_PHY_BCR_RESET                       (uint16_t) (0x8000)
#define ETH_PHY_BCR_LOOPBACK                    (uint16_t) (0x4000)
#define ETH_PHY_BCR_SPEED100MHz                 (uint16_t) (0x2000)
#define ETH_PHY_BCR_AUTONEGOTIATIONENABLE       (uint16_t) (0x1000)
#define ETH_PHY_BCR_POWERDOWN                   (uint16_t) (0x0800)
#define ETH_PHY_BCR_ISOLATE                     (uint16_t) (0x0400)
#define ETH_PHY_BCR_AUTONEGOTIATIONRESTART      (uint16_t) (0x0200)
#define ETH_PHY_BCR_DUPLEX                      (uint16_t) (0x0100)
///@}

/* Fields of BSR Register */
///@{
#define ETH_PHY_BSR_100BASET_FULLDUPLEX         (uint16_t) (0x4000)
#define ETH_PHY_BSR_100BASET_HALFDUPLEX         (uint16_t) (0x2000)
#define ETH_PHY_BSR_10BASET_FULLDUPLEX          (uint16_t) (0x1000)
#define ETH_PHY_BSR_10BASET_HALFDUPLEX          (uint16_t) (0x0800)
#define ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED    (uint16_t) (0x0020)
#define ETH_PHY_BSR_LINKUP                      (uint16_t) (0x0004)
///@}

/* Fields of ISFR Register */
///@{
#define ETH_PHY_ISFR_INT8                       (uint16_t) (0x0100)
#define ETH_PHY_ISFR_INT7                       (uint16_t) (0x0080)
#define ETH_PHY_ISFR_INT6                       (uint16_t) (0x0040)
#define ETH_PHY_ISFR_INT5                       (uint16_t) (0x0020)
#define ETH_PHY_ISFR_INT4                       (uint16_t) (0x0010)
#define ETH_PHY_ISFR_INT3                       (uint16_t) (0x0008)
#define ETH_PHY_ISFR_INT2                       (uint16_t) (0x0004)
#define ETH_PHY_ISFR_INT1                       (uint16_t) (0x0002)
///@}

/* Fields of ISFR Register */
///@{
#define ETH_PHY_IMR_INT8                        (uint16_t) (0x0100)
#define ETH_PHY_IMR_INT7                        (uint16_t) (0x0080)
#define ETH_PHY_IMR_INT6                        (uint16_t) (0x0040)
#define ETH_PHY_IMR_INT5                        (uint16_t) (0x0020)
#define ETH_PHY_IMR_INT4                        (uint16_t) (0x0010)
#define ETH_PHY_IMR_INT3                        (uint16_t) (0x0008)
#define ETH_PHY_IMR_INT2                        (uint16_t) (0x0004)
#define ETH_PHY_IMR_INT1                        (uint16_t) (0x0002)
///@}

/* Fields of ANA Register */
///@{
#define ETH_PHY_ANA_100BASET_FULLDUPLEX         (uint16_t) (0x0100)
#define ETH_PHY_ANA_100BASET                    (uint16_t) (0x0080)
#define ETH_PHY_ANA_10BASET_FULLDUPLEX          (uint16_t) (0x0040)
#define ETH_PHY_ANA_10BASET                     (uint16_t) (0x0020)
#define ETH_PHY_ANA_SELDEFAULT                  (uint16_t) (0x0001)
#define ETH_PHY_ANA_ALL                         (uint16_t) (0x01E1)
///@}

/* Fields of SCSR Register */
///@{
#define ETH_PHY_SCSR_100BASET_FULLDUPLEX        (uint16_t) (0x0018)
#define ETH_PHY_SCSR_100BASET_HALFDUPLEX        (uint16_t) (0x0008)
#define ETH_PHY_SCSR_10BASET_FULLDUPLEX         (uint16_t) (0x0012)
#define ETH_PHY_SCSR_10BASET_HALFDUPLEX         (uint16_t) (0x0002)
#define ETH_PHY_SCSR_SPEED_M                    (uint16_t) (0x001C)
#define ETH_PHY_SCSR_AUTODONE                   (uint16_t) (0x1000)
#define ETH_PHY_SCSR_WRITEONE                   (uint16_t) (0x0040)
///@}




/**
 * @brief   Symbols for fields in MAC Address registers
 * 
 * @note    MAC Address #0 has a different format
 */
///@{
#define ETH_MACADDR_MBC_AE      (1<<31)
#define ETH_MACADDR_MBC_SA      (1<<30)
#define ETH_MACADDR_MBC_BYTE5   (1<<29)
#define ETH_MACADDR_MBC_BYTE4   (1<<28)
#define ETH_MACADDR_MBC_BYTE3   (1<<27)
#define ETH_MACADDR_MBC_BYTE2   (1<<26)
#define ETH_MACADDR_MBC_BYTE1   (1<<25)
#define ETH_MACADDR_MBC_BYTE0   (1<<24)
///@}



#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief   Flags for buffer initialization
 * 
 * @note    ETH_Init must run AFTER buffer initialization
 */
///@{
#define TXBUFFER_INITIALIZED            1
#define RXBUFFER_INITIALIZED            2

static uint8_t buffers_initialized = 0;
///@}
#endif



/**
 * @brief   small simple delay routine
 */

static void delay(int count) {
volatile int c = count;

    while( c-- ) {}

}


////////////////// IRQ Handler /////////////////////////////////////////////////////////////////////

#ifdef ETH_USE_ETH_IRQ
/**
 * @brief   ETH interrupt handler
 */

void ETH_IRQHandler(void) {

    // Check if a frame was received
    if( ETH->DMASR&ETH_DMASR_RS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameReceived ) ETH_Callbacks.FrameReceived(0);
        ETH->DMASR = ETH_DMASR_RS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Check if a frame was transmitted
    if( ETH->DMASR&ETH_DMASR_TS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameTransmitted ) ETH_Callbacks.FrameTransmitted(0);
        ETH->DMASR = ETH_DMASR_TS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // ETH DMA Error (Abnormal Interrupt Summary)
    if( ETH->DMASR&ETH_DMASR_AIS ) {
        /* Call back if defined */
        if( ETH_Callbacks.ErrorDetected ) ETH_Callbacks.ErrorDetected(0);
        ETH->DMASR = ETH_DMASR_AIS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Clear interrupt summary
    ETH->DMASR = ETH_DMASR_NIS;
}
#endif

////////////////// MAC Address Management //////////////////////////////////////////////////////////

/*
 * @brief   rev64
 *
 * @note    reverse byte order of a 64 bit integer
 */


static uint64_t rev64(uint64_t x) {
uint32_t xh,xl,xt;

    xt = (uint32_t) (x>>32);
    xl = __REV(xt);
    xt = (uint32_t) x;
    xh = __REV(xt);
    x = (((uint64_t) xh)<<32) | (uint64_t) xl;
    return x;

}

/**
 * @brief   Set Mac Address #0
 *
 * @note    The MAC address high register holds the upper 16 bits of the 6-byte 
 *          first MAC address of the station. Note that the first DA byte that 
 *          is received on the MII interface corresponds to the LS Byte 
 *          (bits [7:0]) of the MAC address low register. For example, if
 *          0x1122 3344 5566 is received (0x11 is the first byte) on the MII 
 *          as the destination address, then the MAC address register [47:0]
 *          is compared with 0x6655 4433 2211.
 */
void
ETH_SetMACAddress(uint64_t macaddr) {
uint64_t macaddr_rev;
const uint32_t mo = (1<<31);

