hans-jorg/stm32f746g/X30-Ethernet/eth.c
    macaddr_rev = rev64(macaddr);

    ETH->MACA0HR =  ((uint32_t) (macaddr_rev>>32)&0xFFFF)|mo;
    ETH->MACA0LR =   (uint32_t) (macaddr_rev);
}

/**
 * @brief   Set MAC Address #0 to #3
 *
 * @note    
 * 
 * @param   n: which MAC Address
 * @param   macaddr: 48-bit MAC Address in a 64-bit variable
 * @param   mbc: Mask byte control, source and address enable flag
 * 
 * @note    See 38.8.2 of RM
 */

void
ETH_SetMACAddressN(uint32_t n, uint64_t macaddr, uint32_t mbc) {
const uint32_t mo = (1<<31);
uint64_t macaddr_rev;

    macaddr_rev = rev64(macaddr);
    switch(n) {
    case 0:
        ETH->MACA0HR = ((uint32_t) (macaddr_rev>>32)&0xFF)|mo;
        ETH->MACA0LR =  (uint32_t) (macaddr_rev);
        break;
    case 1:
        ETH->MACA1HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA1LR =  (uint32_t) (macaddr);
        break;
    case 2:
        ETH->MACA2HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA2LR =  (uint32_t) (macaddr);
        break;
    case 3:
        ETH->MACA3HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA3LR =  (uint32_t) (macaddr);
        break;
    }

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Least significant byte first (CPU order)
 */
void
ETH_GetMACAddressAsVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>0)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>40)&0xFF;

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Most significant byte first (Network order)
 */
void
ETH_GetMACAddressAsNetworkOrderedVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>40)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>0)&0xFF;

}

////////////////////////////////// Pin management //////////////////////////////////////////////////

#if ETH_USEGPIOFORCONFIGURATION == 1

/**
 * Configuration for ETH
 *
 *    | Board Signal | MCU Pin  |  AF  |  TRX Pin           | Description              |
 *    |--------------|----------|------|--------------------|--------------------------|
 *    | RMII_TX_EN   |  PG11    |  11  |  TXEN              | Transmit Enable          |
 *    | RMII_TXD0    |  PG13    |  11  |  TXD0              | Transmit Data 0          |
 *    | RMII_TXD1    |  PG14    |  11  |  TXD1              | Transmit Data 1          |
 *    | RMII_RXD0    |  PC4     |  11  |  RXD0/MODE0        | Receive Data 0           |
 *    | RMII_RXD1    |  PC5     |  11  |  RDD1/MODE1        | Receive Data 1           |
 *    | RMII_RXER    |  PG2     |   0  |  RXER/PHYAD0       | Receive Error            |
 *    | RMII_CRS_DV  |  PA7     |  11  |  CRS_DV/MODE2      | Carrier Sense/Data Valid |
 *    | RMII_MDC     |  PC1     |  11  |  MDC               | SMI Clock                |
 *    | RMII_MDIO    |  PA2     |  11  |  MDIO              | SMI Data Input/Output    |
 *    | RMII_REF_CLK |  PA1     |  11  |  nINT/REFCLK0      | 50 MHz REF_CLK           |
 *    | NRST         |          |      |  rRST              | Reset                    |
 *    | OSC_25M      |          |      |  XTAL1/CLKIN       |                          |
 *
 * NOTE: PG2 is used as a GPIO input. This is the default.
 */

static const GPIO_PinConfiguration pinconfig[] = {
/*
 *    | Parameter         |   Value   | Description              |
 *    |-------------------|-----------|--------------------------|
 *    | AF                |    11     | Alternate function ETH   |
 *    | Mode              |     2     | Alternate function       |
 *    | OType             |     0     | Push pull                |
 *    | OSpeed            |     3     | Very High Speed          |
 *    | Pull-up/Push down |     0     | No pull-up or push-down  |
 */
/*    GPIOx    Pin      AF  M  O  S  P  I */
   {  GPIOG,   11,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXEN
   {  GPIOG,   13,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXD0
   {  GPIOG,   14,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXD1
   {  GPIOC,   4,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_RXD0
   {  GPIOC,   5,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_RXD1
   {  GPIOG,   0,       11, 0, 0, 3, 0, 0  },       // ETH_RMII_RXER     
   {  GPIOA,   7,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_CRS_DV
   {  GPIOC,   1,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_MDC
   {  GPIOA,   2,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_MDIO
   {  GPIOA,   1,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_REFCLK
//
   {      0,   0,        0, 0,  0, 0, 0, 0 }        // End of List Mark
};

static void
ConfigureETHPins(void) {

    /* Configure pins from table*/
    GPIO_ConfigureMultiplePins(pinconfig);

}


#else

/* Configuring pins using direct access to registers */

#define ETH_AF                    (11)
#define ETH_MODE                  (2)
#define ETH_OTYPE                 (0)
#define ETH_OSPEED                (3)
#define ETH_PUPD                  (0)

static void
ConfigureETHPins(void) {
uint32_t mAND,mOR; // Mask

    // Configure pins in GPIOA
    // 1/REFCLK  2/MDIO  7/CRS_DV

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

    mAND =   GPIO_AFRH_AFRH1_Msk
            |GPIO_AFRH_AFRH2_Msk
            |GPIO_AFRH_AFRH7_Msk;
    mOR  =   (ETH_AF<<GPIO_AFRH_AFRH1_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH2_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH7_Pos);
    GPIOA->AFR[0]  = (GPIOA->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER2_Msk
            |GPIO_MODER_MODER7_Msk;
    mOR  =   (ETH_MODE<<GPIO_MODER_MODER1_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER2_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER7_Pos);
    GPIOA->MODER   = (GPIOA->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR2_Msk
            |GPIO_OSPEEDR_OSPEEDR7_Msk;
    mOR  =   (ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR1_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR2_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR7_Pos);
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR2_Msk
            |GPIO_PUPDR_PUPDR7_Msk;
    mOR  =   (ETH_PUPD<<GPIO_PUPDR_PUPDR1_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR2_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR7_Pos);
    GPIOA->PUPDR   = (GPIOA->PUPDR&~mAND)|mOR;

