hans-jorg/stm32f746g/X30-Ethernet/eth.c
    mAND =   GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT2_Msk
            |GPIO_OTYPER_OT7_Msk;
    mOR  =   (ETH_OTYPE<<GPIO_OTYPER_OT1_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT2_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT7_Pos);
    GPIOA->OTYPER  = (GPIOA->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOC
    // 1/MDC  4/RXD0  5/RXD1

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

    mAND =   GPIO_AFRH_AFRH1_Msk
            |GPIO_AFRH_AFRH4_Msk
            |GPIO_AFRH_AFRH5_Msk;
    mOR  =   (ETH_AF<<GPIO_AFRH_AFRH1_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH4_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH5_Pos);
    GPIOC->AFR[0]  = (GPIOC->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER4_Msk
            |GPIO_MODER_MODER5_Msk;
    mOR  =   (ETH_MODE<<GPIO_MODER_MODER1_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER4_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER5_Pos);
    GPIOC->MODER   = (GPIOC->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR4_Msk
            |GPIO_OSPEEDR_OSPEEDR5_Msk;
    mOR  =   (ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR1_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR4_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR5_Pos);
    GPIOC->OSPEEDR = (GPIOC->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR4_Msk
            |GPIO_PUPDR_PUPDR5_Msk;
    mOR  =   (ETH_PUPD<<GPIO_PUPDR_PUPDR1_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR4_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR5_Pos);
    GPIOC->PUPDR   = (GPIOC->PUPDR&~mAND)|mOR;

    mAND =   GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT4_Msk
            |GPIO_OTYPER_OT5_Msk;
    mOR  =   (ETH_OTYPE<<GPIO_OTYPER_OT1_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT4_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT5_Pos);
    GPIOC->OTYPER  = (GPIOC->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOG
    // 11/TX_EN  13/TXD0  14/TXD1

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;

    mAND =   GPIO_AFRH_AFRH3_Msk
            |GPIO_AFRH_AFRH5_Msk
            |GPIO_AFRH_AFRH6_Msk;
    mOR  =   (ETH_AF<<GPIO_AFRH_AFRH3_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH5_Pos)
            |(ETH_AF<<GPIO_AFRH_AFRH6_Pos);
    GPIOG->AFR[1]  = (GPIOG->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER11_Msk
            |GPIO_MODER_MODER13_Msk
            |GPIO_MODER_MODER14_Msk;
    mOR  =   (ETH_MODE<<GPIO_MODER_MODER11_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER13_Pos)
            |(ETH_MODE<<GPIO_MODER_MODER14_Pos);
    GPIOG->MODER   = (GPIOG->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR11_Msk
            |GPIO_OSPEEDR_OSPEEDR13_Msk
            |GPIO_OSPEEDR_OSPEEDR14_Msk;
    mOR  =   (ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR11_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR13_Pos)
            |(ETH_OSPEED<<GPIO_OSPEEDR_OSPEEDR14_Pos);
    GPIOG->OSPEEDR = (GPIOG->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR11_Msk
            |GPIO_PUPDR_PUPDR13_Msk
            |GPIO_PUPDR_PUPDR14_Msk;
    mOR  =   (ETH_PUPD<<GPIO_PUPDR_PUPDR11_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR13_Pos)
            |(ETH_PUPD<<GPIO_PUPDR_PUPDR14_Pos);
    GPIOG->PUPDR   = (GPIOG->PUPDR&~mAND)|mOR;

    mAND =   GPIO_OTYPER_OT11_Msk
            |GPIO_OTYPER_OT13_Msk
            |GPIO_OTYPER_OT14_Msk;
    mOR  =   (ETH_OTYPE<<GPIO_OTYPER_OT11_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT13_Pos)
            |(ETH_OTYPE<<GPIO_OTYPER_OT14_Pos);
    GPIOG->OTYPER  = (GPIOG->OTYPER&~mAND)|mOR;

}

#endif


/**
 * @brief   ETH_ReadRMIIError
 * 
 * @note    Reads the RMII_RXER signal
 * 
 * @note    This signal is connected to pin 2 of GPIO Port G
 * 
 * @note    There is no provision for the connection of RMII_RX_ER, but thres is
 *          two for MII_RX_ER at PB10 and PI10
 */

uint32_t 
ETH_ReadRMIIError(void) {
const uint32_t ETH_RMIIRXER_MASK = (1<<2);

    return GPIOG->IDR&ETH_RMIIRXER_MASK;

}

#ifdef ETH_USE_GPIO_INTERRUPT
/**
 * @brief   Interrupt routine for RMII_RX_ER
 * 
 * @note    The RMII_RXER is connected to pin 2 of GPIO Port G
 */


void EXTI2_IRQHandler(void) {

     // TODO

}

/**
 * @brief  Configure that RMII_RX_ER generates an interrupt
 * 
 * @note   Since RMII_RX_ER is connected to pin 2 of GPIO G,
 *         and that only one pin 2 of a GPIO port can generate
 *         an interrupt, this routines configure the EXTI controller
 *         that GPIOG generates the interrupt.
 */
void ConfigureEXTI2(void) {

    SYSCFG->EXTICR1 =  (SYSCFG->EXTICR1&~SYSCFG_EXTICR1_EXT2_Msk)
                      |(SYSCFG_EXTICR1_EXTI2_PG);
}
#endif

/////////////////////////////////// Clock management ///////////////////////////////////////////////
/**
 * @brief ETH_EnableClock
 */
void ETH_EnableClock(uint32_t which) {

    // Enable PTP clock
    if( which&ETH_CLOCK_PTP )   RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACPTPEN;
    // Enable Ethernet MAC Reception clock
    if( which&ETH_CLOCK_MACRX ) RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACRXEN;
    // Enable Ethermet Trasmission clock
    if( which&ETH_CLOCK_MACTX ) RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACTXEN;
    // Enable MAC clock address
    if( which&ETH_CLOCK_MAC )   RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACEN;

}

/**
 * @brief ETH_DisableClock
 */
void ETH_DisableClock(uint32_t which) {

    // Disable PTP clock
    if( which&ETH_CLOCK_PTP )   RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACPTPEN;
    // Disable Ethernet Reception clock
    if( which&ETH_CLOCK_MACRX ) RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACRXEN;
    // Disable Ethermet Trasmission clock
    if( which&ETH_CLOCK_MACTX ) RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACTXEN;
    // Disable MAC clock address
    if( which&ETH_CLOCK_MAC )   RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACEN;

}


///////////////////////////// PHY management ///////////////////////////////////////////////////////


/**
 * @brief  ETH_WritePHYRegister
 */
static int ETH_WritePHYRegister( uint32_t reg, uint16_t val) {
uint32_t macmiiar = ETH->MACMIIAR;

    // Clear all fields except CR
    macmiiar &= ETH_MACMIIAR_CR_Msk;

    // Set PHY address
    macmiiar |= (ETH_PHY_ADDRESS<<ETH_MACMIIAR_PA_Pos);

