hans-jorg/stm32f746g/X30-Ethernet/eth.c
    // Set PHY register
    macmiiar |= ((reg)<<ETH_MACMIIAR_MR_Pos);

    // Set operation to write
    macmiiar |= ETH_MACMIIAR_MW;

    // Wait until PHY is ready
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    // Set data to be written
    ETH->MACMIIDR = val;


    // Set busy flag
    macmiiar |= ETH_MACMIIAR_MB;
    
    // Write operation
    ETH->MACMIIAR = macmiiar;

    // Test if it runs ok
    delay(10);
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    return 0;
}


/**
 * @brief  ETH_ReadPHYRegister
 */
static int ETH_ReadPHYRegister( uint32_t reg, uint16_t *val) {
uint32_t macmiiar = ETH->MACMIIAR;

    // Set register to 0
    *val = 0;

    // Set data register to 0
    ETH->MACMIIDR = 0;

    // Clear all fields except CR
    macmiiar &= ETH_MACMIIAR_CR_Msk;

    // Set PHY address
    macmiiar |= (ETH_PHY_ADDRESS<<ETH_MACMIIAR_PA_Pos);

    // Set PHY register
    macmiiar |= ((reg)<<ETH_MACMIIAR_MR_Pos);

    // Set read operation
    macmiiar &= ~ETH_MACMIIAR_MW;

    // Wait until PHY is ready
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB  ) {}  // TODO: Add timeout

    // Set busy flag
    macmiiar |= ETH_MACMIIAR_MB;

    // Start read operation
    ETH->MACMIIAR = macmiiar;

    // Test if it runs ok
    delay(10);
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    // Read value
    *val = ETH->MACMIIDR;

    return 0;
}

/**
 * @brief  Configure PHY
 *
 * @note   PHY is Microchip LAN
 */

static int ETH_ConfigurePHY(void) {
uint16_t value;
int retries;
int configured = 0;

    ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_RESET);
    delay(ETH_DELAY_AFTERRESET);
    // Wait until Soft Reset bit self cleared
    do { 
        ETH_ReadPHYRegister(ETH_PHY_BCR,&value);
        delay(ETH_DELAY_AFTERRESET);
    } while ( value&ETH_PHY_BCR_RESET );

    // Configure Auto-Negotiation Advertisement Register
    // Should be done by MODE2_0 pins!!
    ETH_WritePHYRegister(ETH_PHY_ANA,ETH_PHY_ANA_ALL);
    delay(ETH_DELAY_BETWEENTESTS);

    // It this needed?
    //value &= ETH_PHY_BCR_LOOPBACK;

    // Wait until connected (linked)
    retries = ETH_RETRIES_LINK;
    do {
        value = 0;
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        delay(ETH_DELAY_BETWEENTESTS);
    } while( (retries-->0)&&((value&ETH_PHY_BSR_LINKUP)==0) );

    // If not connected, 
    if( (value&ETH_PHY_BSR_LINKUP) == 0 ) {


        return -1;
    }

    if( ETH_Config&ETH_CONFIG_AUTONEGOTIATE ) {
       // Start autonegotiating
        ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_AUTONEGOTIATIONENABLE);
        delay(ETH_DELAY_AFTERREGISTERWRITE);
    
        // Wait until Auto Negotiation Completed
        retries = ETH_RETRIES_AUTONEGOTIATION;
        do {
            value = 0;
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
        } while( (retries-->0)&&((value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)==0) );

        if( (value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED) == 0 ) {
            // Autonegotiation failed

        }           
    } else {
        // Manual configuration


    }
    // Configure speed and connection
    ETH_UpdateConfigStatus();

    /*
     * This code sequence is identical to the one generated by
     * STM32CubeMX.
     * 
     * Since nINT not connected, PHY can not generate interrupts.
     * According LAN8742A datasheet, change of ISFR does not make sense,
     * because its fields are Read-Only.
     * 
     * But this register is vendor-specific. Maybe it does not work
     * following the datasheet.
     * 
     * From oryx-embedded.com
     * Any link failure condition is latched in the BMSR register. Reading
     * the register twice will always return the actual link status
     */
    // Enable interrupt on link status 
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);
    value |= ETH_PHY_ISFR_INT4;
    ETH_WritePHYRegister(ETH_PHY_ISFR,value);
    // Read again to clear
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);

    return 0;
}


/**
 * @brief  Table used to set CR clock range to select MDC clock frequency
 *
 * @note   See description of CR field of MACMIIAR register in section 38.8.1 in RM.
 *
 * @note   The order is important. The index is used to configure field!!!
 */
struct {
    uint32_t    minfreq;
    uint32_t    maxfreq;

} static cr_tab[] = {
    {   60000000,       100000000   },      // CR=000
    {  100000000,       150000000   },      // CR=001
    {   20000000,        35000000   },      // CR=010
    {   35000000,        60000000   },      // CR=011
    {  150000000,       216000000   },      // CR=100
    {          0,               0   }
};

/**
 * @brief  Find CR encoding
 */
static uint32_t findCREncoding(void) {
uint32_t hclkfreq;
int cr;

    hclkfreq = SystemGetHCLKFrequency();
    cr = 0;
    while( cr_tab[cr].minfreq
        && ( (hclkfreq < cr_tab[cr].minfreq)
            || (hclkfreq > cr_tab[cr].maxfreq)
           )
         ) {
        cr++;
    }
    return cr<<ETH_MACMIIAR_CR_Pos;

}

/**
 * @brief   ETH ConfigureMAC
 *
 * @note    Configuring Media Access Control of the ETH Controller 
 * 
 * @note    MAC Registers
 * 
 *          * MACR: configuration register
 *          * MACFFR: frame filter register
 *          * MACHTHR: hash table high register
 *          * MACHTLR: hash table low register
 *          * MACMIIAR: MII (Media Independent Interface) address register
 *          * MACMIIDR: MII (Media Independent Interface) data register
 *          * MACFCR: flow control register
 *          * MACVLANTR: VLAN tag register
 *          * MACRWUFFR: remote wakeup frame filter register
 *          * MACPMRCSR: PMT (Power Management) control and status register
 *          * MACDBGR: debug register
 *          * MACSR: interrupt status register
 *          * MACIMR: interrupt mask register
 *          * MACA0HR: address 0 high register
 *          * MACA0LR: address 0 low register
 *          * MACA1HR: address 1 high register
 *          * MACA1LR: address 1 low register
 *          * MACA2HR: address 2 high register
 *          * MACA2LR: address 2 low register
 *          * MACA3HR: address 3 high register
 *          * MACA3LR: address 3 low register
 
 * 
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Watchdog enabled
 *          * Jabber enabled
 *          * Interframe gap set to 96
 *          * Carriersense enabled
 *          * Receive own enable
 *          * Loopback disabled
 *          * Checksum done by hardware
 *          * Retry transmission disabled
 *          * Automatic PAD CRC strip disabled
 *          * Backoff limit set to 10
 *          * Deferral check disabled
 *          * Receive all disabled
 *          * Source address filter disabled
 *          * Block all control frames
 *          * Broadcastframes reception_enabled
 *          * Destination filter normal
 *          * Promiscuous mode disabled
 *          * Multicast frames perfect
 *          * Unicast frames filter perfect
 *          * Zero quanta pause disabled
 *          * Pause low threshold set to -4
 *          * Unicast pause frame detect disabled
 *          * Receive flow control disabled
 *          * Transmit flow control disabled
 *
 */

static int ETH_ConfigureMAC(void) {

    /*************** MACCR: MAC Configuration Register ************************/

