hans-jorg/stm32f746g/X30-Ethernet/eth.c
    uint32_t maccr = ETH->MACCR;

    // Clear all fields
    maccr &= 0;

    // Configure
    // There are many fields with negative logic (1 to disable, 0 to enable)
    // No CRC stripping
    // Watchdog enable. Receive at most 2048 bytes
    // Jabber enable. Transmit at most 2048 bytes
    // Carrier sense active and generate error/abort transmission
    // Fast Ethernet will be set accordingly later
    // Receive own frames enabled!!!
    // No Loopback
    // Duplex mode will be set accordingly later
    // IPv4 checksum offload (ETH controller calculates CRC)
    // Retry enabled (based on BL)
    // No automatic pad/CRC stripping
    // Back-off limit = 10
    // No deferral check
    // Receiver and transmitter disabled, for now
    maccr |=     0
                |ETH_MACCR_IPCO         // Checksum by hardware
                |ETH_MACCR_IFG_96Bit    // Interframe gap = 96
                |ETH_MACCR_RD           // Retry disable = 1
                |ETH_MACCR_BL_10        // Backoff limit = min(n,4)
                ;

                

    // Set configuration for Fast Ethernet and Full Duplex, when possible
    if( ETH_ConfigStatus&ETH_CONFIG_100BASET )   maccr |= ETH_MACCR_FES;
    if( ETH_ConfigStatus&ETH_CONFIG_FULLDUPLEX ) maccr |= ETH_MACCR_DM;

    // Set configuration
    ETH->MACCR = maccr;

    /*************** MACFFR: MAC Frame Filter Register ************************/

    uint32_t macffr = ETH->MACFFR;

    // Clear all fields
    macffr  &= 0;

    // Configure
    // Receive all disabled
    // Perfect filter????
    // Source address filter disabled
    // Source address inverse filter disabled
    // Block all control frames
    // Broadcast frame enabled
    // Pass all multicast depends on Hash multicast bit
    // Destination address inverse filtering normal
    // Hash multicast perfect
    // No promiscuous mode
    macffr |=    0
                |ETH_MACFFR_PCF_BlockAll    // Block all control frames
                ;
    // Set configuration
    ETH->MACFFR = macffr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MACHTxR: Hash table high/low register ********************/

    ETH->MACHTHR = 0;
    ETH->MACHTLR = 0;

    /*************** MACMIIAR: MII address register ***************************/
    // Used in ConfigurePHY

    /*************** MACMIIDR: MII data register ******************************/
    // Used in ConfigurePHY

    /*************** MACFCR: Flow control register ****************************/

    uint32_t macfcr = ETH->MACFCR;

    // Clear all fields
    macfcr  &= 0;

    // Configure
    // pause time = 0
    // zero quanta pause at normal operation
    // pause low threshold set to Pause time - 4
    // unicast pause frame detect only for multicast address at 802.3 standard
    // receive flow control disabled
    // transmit flow control disabled
    // flow control ??

    macfcr |=    0
                |ETH_MACFCR_PLT_Minus4      // Pause low = Pause time - 4
                 ;

    // Set configuration
    ETH->MACFCR = macfcr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MACMVLANTR: VLAN tag register ****************************/

    uint32_t macvlantr = ETH->MACVLANTR;

    // Clear all fields
    macvlantr &= 0;

    // Configure
    // 16 bit comparison
    // Tag = 0
    ETH->MACVLANTR  = macvlantr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MAC Address **********************************************/

    ETH_SetMACAddress(ETH_MACADDRESS);

    return 0;
}



/**
 * @brief   Configure DMA
 *
 * @note    Configurate DMA
 * 
 * @note    DMA Registers
 * 
 *          * DMAMBR: Bus mode register
 *          * DMATODR: Transmit poll demand register
 *          * DMARPDR: Receive poll demand register
 *          * DMARDLAR: Receive descriptor list address register
 *          * DMARDLAR: Transmit descriptor list address register
 *          * DMASR: Status register
 *          * DMAOMR: Operation mode register
 *          * DMAIER: Interrupt enable register
 *          * DMAMFBOCR: Missed frame and buffer overflow counter register
 *          * DMARSWTR: Receive status watchdog timer register
 *          * DMACHTDR: Current host transmit descriptor register
 *          * DMACHRDR: Current host receive descriptor register
 *          * DMACHRBAR: Current host transmit buffer address register
 *          * DMACHTBAR: Current host transmit buffer address register
 * 
 *
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Drop TCP/IP Frame on Checksum error enabled
 *          * Receive store forward enabled
 *          * Flush received frame enable
 *          * Transmit store forward enabled
 *          * Transmit threshold control set to 64 bytes
 *          * Forward error frames disabled
 *          * Forward undersized goodframes disabled
 *          * Received threshold control set to 64 bytes
 *          * Second frame operarted enabled
 *          * Address aligned beats enabled
 *          * Fixed burst_Enabled
 *          * Rx DMA burst length set to 32 beats
 *          * TxDMA burst length_set to 32 beats
 *          * DMA enhanced descriptor enabled
 *          * Descripto length set to 0x0;
 *          * DMA arbitration roundrobin RX/TX 1/1
 */

static int ETH_ConfigureDMA(void) {

    /*************** DMA Mode Register ****************************************/

    uint32_t dmabmr = ETH->DMABMR;

    // Clear all fields
    dmabmr &= 0;

    // Configure
    // Fixed burst for length < 16
    // Address aligned beats enabled
    // PBL mode 4x disabled
    // Separate PBL (Programmable Burst Length) for Rx and TX
    // Rx DMA PBL (Programmable Burst Length)
    // Fixed burst enabled
    // Rx/Tx priority ratio = 1:1
    // Programmable Burst Length (PBL) = 32
    // Enhanced descriptor format enabled (IPv4 offload active)
    // Descriptor skip length = 0
    // DMA arbitration = round robin
    // Software

    dmabmr |=  ETH_DMABMR_AAB
              |ETH_DMABMR_USP
              |ETH_DMABMR_RDP_32Beat
              |ETH_DMABMR_FB
              |ETH_DMABMR_RTPR_1_1
              |ETH_DMABMR_PBL_32Beat
              |ETH_DMABMR_EDE
              ;

    // Configure DMABMR
    ETH->DMABMR = dmabmr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);


