hans-jorg/stm32f746g/X30-Ethernet/eth.c
    /*************** DMA Operation Mode Register ******************************/
   uint32_t dmaomr = ETH->DMAOMR;

    // clear fields
    dmaomr &= 0;

    // Configure
    // Drop frame with checksum error
    // Receive store and forward enabled
    // Enable flush of received framed
    // Transmit store and forward
    // Flush transmit FIFO (do not touch it yet!)
    // Transmit threshold control = 64 
    // Start/stop transmission (do not touch it yet!)
    // Forward error frames disabled
    // Forward undersized good frames disabled
    // Receive threshold control = 64
    // Operate on second frame enabled
    // Start/stop receive

    dmaomr |= ETH_DMAOMR_RSF
             |ETH_DMAOMR_TSF
             |ETH_DMAOMR_TTC_64Bytes
             |ETH_DMAOMR_RTC_64Bytes
             |ETH_DMAOMR_OSF
             ;
    // Configure DMAOMR
    ETH->DMAOMR = dmaomr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    return 0;
}


/**
 * @brief ETH ETH_InitTXDescriptors
 *
 * @note  desc must be an array of DMA Descriptors
 *
 * @note  area must be at least count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */

void ETH_InitTXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_TXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_TXDESC_CHAINED | ETH_TXDESC_CIC;
        desc->ControlBufferSize = ETH_TXBUFFERSIZE_INT8UNITS;
        desc->Buffer1Addr = (uint32_t) (a + i*ETH_TXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr = (uint32_t) (ETH_TXDescriptors+((i+1)%count));
        desc->ExtendedStatus = 0; 
        desc->Reserved1 = 0;
        desc->TimeStampLow = 0;
        desc->TimeStampHigh = 0;
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMATDLAR = (uint32_t) ETH_TXDescriptors;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= TXBUFFER_INITIALIZED;
#endif

}

/**
 * @brief ETH ETH_InitRXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */


void ETH_InitRXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_RXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_RXDESC_OWN;
        desc->ControlBufferSize = ETH_RXBUFFER_SIZE | ETH_RXDESC_CHAINED 
                                | ETH_RXBUFFER_DIC;
        desc->Buffer1Addr =  (uint32_t) (a + i*ETH_RXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr =  (uint32_t) (ETH_RXDescriptors + ((i+1)%count));
        desc->ExtendedStatus = 0; 
        desc->Reserved1 = 0;
        desc->TimeStampLow = 0;
        desc->TimeStampHigh = 0;
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMARDLAR = (uint32_t) ETH_RXDescriptors;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= RXBUFFER_INITIALIZED;
#endif

}

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief ETH InitializeBuffers
 *
 * @note  Initialize all descriptors to point to buffers insided area
 *
 * @note  area must be aligned to a word address.]
 *
 * @note  area must have a size equal or largert to (ETH_TXBUFFER_COUNT*ETH_TXBUFFER_SIZE
 *   +ETH_RXBUFFER_COUNT*ETH_TXBUFFER_SIZE) bytes, with ETH_TXBUFFER_SIZE and ETH_RXBUFFER_SIZE
 *   multiple of sizeof(uint32_t)_
 */

void ETH_InitializeBuffers(char *area) {
uint32_t *a = (uint32_t *) area;

    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,(uint8_t *) a);
    a += ETH_TXBUFFERSIZE_INT32UNITS *ETH_TXBUFFER_COUNT;
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,(uint8_t *) a);

}
#endif

/**
 * @brief   ConfigureMediaInterface
 * 
 * @note    This configuration must be done while the MAC is under reset and
 *          before enabling the MAC clocks. Since this is done using SYSCFG
 *          controller, its clock must be enabled first.
 */
static void ConfigureMediaInterface(void) {
uint32_t media = 1; // RMII PHY Interface

    // Enable SYSCFG clock to select the ethernet PHY interface to be used
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
    __NOP();
    __NOP();
    __DSB();

    //  Select RMII mode
    SYSCFG->PMC = (SYSCFG->PMC&~(SYSCFG_PMC_MII_RMII_SEL))
                 |(media<<SYSCFG_PMC_MII_RMII_SEL_Pos);
}

/**
 * @brief   ETH_Init
 *
 * @note    Initialize ETH controller
 * 
 * @note    When using dynamically allocated buffers, the must be
 *          registered before calling this function
 * 
 * @note    Initialization steps:
 * 
 *        * Setup buffers
 *        * Configure pins for ETH usage
 *        * Configure clocks
 *        * Reset ETH interface
 *        * Configure clock for serial communication
 *        * Configure PHY
 *        * Configure MAC
 *        * Configure DMA
 */

void ETH_Init(void) {

    // Reset callbacks
    ETH_Callbacks.ErrorDetected    = 0;
    ETH_Callbacks.FrameReceived    = 0;
    ETH_Callbacks.FrameTransmitted = 0;
    ETH_Callbacks.LinkStatusChanged= 0;


#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    if( buffers_initialized != (RXBUFFER_INITIALIZED|TXBUFFER_INITIALIZED ) {
        while(1) {}
    }
#else
    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,txbuffer);
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,rxbuffer);
#endif

    // Enable clocks for ETH
    ETH_EnableClock(ETH_CLOCK_MAC|ETH_CLOCK_MACRX|ETH_CLOCK_MACTX);

    // Configure pins
    ConfigureETHPins();

    // Configure Media Interface
    ConfigureMediaInterface();

    // Reset ETH system
    ETH->DMABMR |= ETH_DMABMR_SR;
    // Wait until reset                     
    // TODO: Add timeout
    while( (ETH->DMABMR&ETH_DMABMR_SR) != 0 ) {
        delay(100);
    }

    // Configuring MDC CLock
    uint32_t cr = findCREncoding();
    ETH->MACMIIAR = (ETH->MACMIIAR&~ETH_MACMIIAR_CR_Msk)|cr;

    // Clear the MAC configuration
    ETH_ConfigureMAC();

    // Configure DMA
    ETH_ConfigureDMA();

    // Configuring PHY
    ETH_ConfigurePHY();

    // Configuring interrupt
    //ETH->DMAIER |= (ETH_DMAIER_NISE|ETH_DMAIER_RIE);

