hans-jorg/stm32f746g/X30-Ethernet/eth.c
#ifdef ETH_USE_ETH_IRQ
    NVIC_SetPriority(ETH_IRQn,ETH_IRQLevel);
    NVIC_EnableIRQ(ETH_IRQn);
#endif

}


/**
 * @brief   ETH Start
 *
 * @note    ETH_Init must be successfully called before
 */

void ETH_Start(void) {

    // Enable transmission
    ETH_EnableTransmissionMAC();

    // Start reception
    ETH_EnableReceptionMAC();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Enable transmission DMA
    ETH_EnableTransmissionDMA();

    // Enable reception DMA
    ETH_EnableReceptionDMA();

}

/**
 * @brief   ETH Stop
 */

void ETH_Stop(void) {

    // Disable reception DMA
    ETH_DisableReceptionDMA();

    // Disable transmission DMA
    ETH_DisableTransmissionDMA();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Stop transmission
    ETH_DisableTransmissionDMA();

    // Stop reception
    ETH_DisableReceptionDMA();
}



/**
 * @brief   ETH_ManualConfig
 * 
 * @note    Configure PHY using configuration in ETH_Config
 */

static void
ETH_ManualConfig(void) {
uint16_t value;

    value = 0;
    if( ETH_Config&ETH_CONFIG_FULLDUPLEX ) {
        if ( ETH_Config&ETH_CONFIG_100BASET )  {
            value |= ETH_PHY_BSR_100BASET_FULLDUPLEX;
        } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
            value |= ETH_PHY_BSR_10BASET_FULLDUPLEX;
        }
    } else if( ETH_Config&ETH_CONFIG_HALFDUPLEX ) {
        if ( ETH_Config&ETH_CONFIG_100BASET )  {
            value |= ETH_PHY_BSR_100BASET_HALFDUPLEX;
        } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
            value |= ETH_PHY_BSR_10BASET_HALFDUPLEX;
        }
    }
    // Write config
    ETH_WritePHYRegister(ETH_PHY_BCR,value);
    delay(ETH_DELAY_AFTERCONFIG);

}


/**
 * @brief   Update configuration status when connected
 * 
 * @note    To be used when connecting
 * 
 * @returns 0 when link not up
 *          1  when configured by autonegotiation
 *          2  when configured manually
 * 
 * @note    ETH_Status is set according the speed and duplex mode 
 */
static void
ETH_UpdateConfigStatus(void) {
int configured = 0;
int retries = 0;
uint16_t value;

    MESSAGE("Entering UpdateConfigStatus\n");

    // Get the result
    ETH_ReadPHYRegister(ETH_PHY_BSR,&value);

    if( (value&ETH_PHY_BSR_LINKUP) == 0 ) {
        ETH_ConfigStatus = ETH_CONFIGSTATUS_LINKDOWN;
        return;
    }
    ETH_ConfigStatus = ETH_CONFIGSTATUS_LINKUP;

    int status = ETH_GetLinkStatus();   
    
    // Set status
    switch(status) {
    case ETH_LINKINFO_100BASET_FULLDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_100BASET;
        ETH_ConfigStatus |= ETH_CONFIG_FULLDUPLEX;
        break;
    case ETH_LINKINFO_100BASET_HALFDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_100BASET;
        ETH_ConfigStatus |= ETH_CONFIG_HALFDUPLEX;
        break;
    case ETH_LINKINFO_10BASET_FULLDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_10BASET;
        ETH_ConfigStatus |= ETH_CONFIG_FULLDUPLEX;
        break;
    case ETH_LINKINFO_10BASET_HALFDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_10BASET;
        ETH_ConfigStatus |= ETH_CONFIG_HALFDUPLEX;
        break;
    }

    // Set MAC configuration for Fast Ethernet and Full Duplex
    uint32_t maccr = ETH->MACCR;
    maccr &= ~(ETH_MACCR_FES|ETH_MACCR_DM);
    if( ETH_ConfigStatus&ETH_CONFIG_100BASET )   maccr |= ETH_MACCR_FES;
    if( ETH_ConfigStatus&ETH_CONFIG_FULLDUPLEX ) maccr |= ETH_MACCR_DM;
    ETH->MACCR = maccr;

    MESSAGE("Exiting UpdateConfigStatus\n");
}




/**
 * @brief   UpdateLinkStatus
 * 
 * @note    It must be called when there is a change in link status
 */
int
ETH_UpdateLinkStatus(void) {
int configured = 0;
int retries = 0;
uint16_t value;

    MESSAGE("Entering UpdateLinkStatus\n");
    if( ETH_Config&ETH_CONFIG_AUTONEGOTIATE ) {
        // Autonegotiate set
        retries = ETH_RETRIES_LINK;
        do {
            value = 0;
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
            retries--;
        } while ((retries>0)&&(value&ETH_PHY_BSR_LINKUP)!=ETH_PHY_BSR_LINKUP);

        if( (value&ETH_PHY_BSR_LINKUP) == 0 ) {
            // Not connected
            configured = 0;
            goto end;
        }

        // Configure Autonegotiate
        ETH_WritePHYRegister(   ETH_PHY_BCR,
                                ETH_PHY_BCR_AUTONEGOTIATIONRESTART
                                );
        delay(ETH_DELAY_AFTERAUTONEGOTIATION);
        retries = ETH_RETRIES_AUTONEGOTIATION;
        MESSAGE("Starting Autonegotiation");
        do {
            value = 0;
            delay(ETH_DELAY_BETWEENTESTS);
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);

            message("BSR=%04X ",value);
        } while(    (retries-->0)
                 && ((value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)==0) );

        if( value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED ) {
            MESSAGE("Success\n");
            // Update config status
            ETH_UpdateConfigStatus();
            configured = 1;
        }
    }
    if( ! configured ) {
        MESSAGE("Failed\n");
        // Autonegotiation not set or not working
        // Configure Speed and Duplex Mode
        ETH_ManualConfig();

        ETH_UpdateConfigStatus();
        configured = 2;
    }

end:
    // Post configuration actions
    MESSAGE("Exiting UpdateLinkStatus\n");

    return configured;

}



/**
 * @brief   Transmit data already in DMA buffer 
 * 
 * @note    size must be smaller or equal to ETH_TXBUFFER_SIZE*ETH_MAX_PACKET_SIZE
 * 
 * @note    It uses a default (non OSF) mode, i.e., only one frame beeing
 *          transmitted
 *
 * @note    Buffer can only be modified when there is no TX DMA operation running
 *
 * @note    Procedure to transmit a multiple buffer frame
 *
 *          1. Wait until descriptors are free (OWN=0)
 *          2. Copy the data to the DMA buffers
 *          3. Adjust descriptors flags
 *          4. Set OWN bit in all descriptors
 *          3. Set ST bit in DMAOMR to make DMA enter in Run state
 *    Copy data to transmission device (send it!)
 *          4.    If not the last one, get next descriptor
 *          5. Until all data is transmitted (No more descriptors with OWN bit set) or
 *             a descriptor has the LS bit set.

