hans-jorg/stm32f746g/X30-Ethernet/eth.c
 *          7. Set ST bit in DMAOMR register to start the DMA transmit engine*
 * 
 * @note    To resume operation, write something to DMATPDR
 *
 */
int
ETH_TransmitFrame(ETH_DMADescriptor *desc, unsigned size) {
int nbuffers,lastbuffersize;


    if( size == 0 )
        return 0;

    MESSAGE("Entering ETH_TransmitFrame\n");

    desc = ETH_TXDescriptors;
    // Check OWN bit in the first descriptor. If it is set, DMA is using it
    if( (desc->Status&ETH_TXDESC_OWN) != 0 ) {
        return -1;      // BUSY!!!!!!
    }

    nbuffers = size/ETH_TXBUFFER_SIZE;
    lastbuffersize = size%ETH_TXBUFFER_SIZE;
    if( lastbuffersize != 0 ) nbuffers++;

    if( nbuffers == 1 ) {
        // Configure first and only descriptor
        desc->Status |= ETH_TXDESC_FIRST|ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc->Status |= ETH_TXDESC_OWN;
        __DSB();
    } else {
        // Configure first descriptor
        desc->Status = (desc->Status&~ETH_TXDESC_LAST)|ETH_TXDESC_FIRST;
        desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        desc->Status |= ETH_TXDESC_OWN;

        // Configure intermediate descriptors
        for(int i=1;i<nbuffers-1;i++) {
            desc->Status  &= ~(ETH_TXDESC_FIRST|ETH_TXDESC_LAST);
            desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC_BUFFER1SIZE_MSK;
            desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            desc->Status |= ETH_TXDESC_OWN;
        }
        // Configure last descriptor
        desc->Status = (desc->Status&~ETH_TXDESC_FIRST)|ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC_BUFFER1SIZE_MSK;
        desc->Status |= ETH_TXDESC_OWN;
        __DSB();
    }

    // Check Transmit buffer status
    if( ETH->DMASR&ETH_DMASR_TBUS ) {
        // Clear it and start transmission
        ETH->DMASR = ETH_DMASR_TBUS;        // Clear
        ETH->DMATPDR = 0;                   // Transmit poll demand
    }

    // Place transmissition in the Run state (just in case)
    ETH->DMAOMR |= ETH_DMAOMR_ST;

    MESSAGE("Exiting ETH_TransmitFrame\n");
    return 0;
}



/**
 * @brief   Receive data
 *
 * @note    Check if there is data in buffers and sets an indicator
 *
 * @note    Procedure to receive a multiple buffer frame
 *
 *       1.  Setup receive descriptors
 *       2.  Set OWN bit
 *       3.  Set bit SR in DMAOMR register to start the DMA receive engine
 *       4.  Repeat
 *             Receive data and store it into the buffer pointed by descriptor
 *             Write the first word (+0 offset) with OWN bit cleared and flags set
 *       5.  Until the last segment is received or the descriptor list does not have
 *           descriptors for the DMA engine, i.e,with OWN bit set.
 *
 * @note    To resume operation or force the scan of the descriptor list, a value 
 *          must be written to the DMA
 *
 * @note    All buffers will use the maximum size, except the last one. One must 
 *          get the FL field to get the size of the data in the last buffer.
 */

int
ETH_ReceiveFrame(ETH_DMAFrameInfo *RxFrameInfo) {
int len;
int bsize;
ETH_DMADescriptor *desc,*descfirst;
uint32_t status;
int first;
int rc = 0;

    // Clean RxFrameInfo
    RxFrameInfo->SegmentCount = 0;
    RxFrameInfo->FirstSegmentDesc = 0;
    RxFrameInfo->LastSegmentDesc = 0;
    RxFrameInfo->FrameLength = 0;

    MESSAGE("Entering ETH_ReceiveFrame\n");

    ETH_EnableReceptionDMA();

    // Searching for First segment
    desc = ETH_RXDescriptors;/*  */
    status = desc->Status;
    first = 0;
    do {
        uint32_t x = (status&ETH_RXDESC_OWN)?1:0;
        message("Processing descriptor at %p (own=%d). ",desc,x);
        first = ((status&ETH_RXDESC_OWN)==0)&&((status&ETH_RXDESC_FIRST)==1);
        if( first ) {
            // found a first segment
            break;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        message("Next is %p\n",desc);
        status = desc->Status;
    } while ( desc != ETH_RXDescriptors );


    if( !first ) {
        MESSAGE("A first segment not found\n");
        rc = -1;
        goto err;
    }

    MESSAGE("Found a first segment\n");
    descfirst = desc;
    status = desc->Status;

    while( (status&ETH_RXDESC_OWN) == 0 )  {
        message("processing descriptor at %p\n",desc);
        len = (status&ETH_RXDESC_FRAMELENGTH_MASK)>>ETH_RXDESC_FRAMELENGTH_POS;
        bsize = (desc->ControlBufferSize&ETH_RXDESC_BUFFER1SIZE_MASK)>>ETH_RXDESC_BUFFER1SIZE_POS;

        if( (status&ETH_RXDESC_FIRST) && (status&ETH_RXDESC_LAST) ) {
            MESSAGE("Received only one frame\n");
           // Only one buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            len = (desc->Status&ETH_RXDESC_FRAMELENGTH_MASK)>>ETH_RXDESC_FRAMELENGTH_POS;
            RxFrameInfo->FrameLength = (len-4);      // exclude CRC
            rc = 1;
            break;
        } else if ( status&ETH_RXDESC_FIRST ) {
            MESSAGE("Received first frame\n");
            // first buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            RxFrameInfo->FrameLength = bsize;
        } else if ( status&ETH_RXDESC_LAST )  {
            MESSAGE("Received last frame\n");
            // last buffer
            RxFrameInfo->LastSegmentDesc  = desc;
            RxFrameInfo->SegmentCount++;
            len = (desc->Status&ETH_RXDESC_FRAMELENGTH_MASK)>>ETH_RXDESC_FRAMELENGTH_POS;
            RxFrameInfo->FrameLength += (len-4);     // exclude CRC
            rc = 1;
            break;
        } else {
            MESSAGE("Received middle frame\n");
            // intermediary
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength += bsize;
        }
        MESSAGE("Next\n");
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == descfirst )
            break;
        status = desc->Status;
    }

err:
    ETH_EnableReceptionDMA();
    MESSAGE("Exiting ETH_ReceiveFrame\n");

