hans-jorg/stm32f746g/X30-Ethernet/eth.c
    return rc;
}


/**
 * @brief   Check if a frame has been received
 *
 * @note    Specially the last buffer must have been received
 *
 */
int
ETH_CheckReception(void) {
ETH_DMADescriptor *desc;
uint32_t SegmentCount = 0;

    desc = ETH_RXDescriptors;

    SegmentCount = 0;
    while(desc) {
        if( (desc->Status&ETH_RXDESC_OWN) != 0 )  {
            return 0;
        }

        if( (desc->Status&ETH_RXDESC_FIRST) && (desc->Status&ETH_RXDESC_LAST) ) {
            // Only one buffer
            SegmentCount = 1;
            return 1;
        } else if( desc->Status&ETH_RXDESC_FIRST ) {
            // First buffer
            SegmentCount = 1;
        } else if ( desc->Status&ETH_RXDESC_LAST ) {
            // Last buffer
            SegmentCount++;
            return 1;
        } else {
            // Middle buffer
            SegmentCount++;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == ETH_RXDescriptors )
            break;
    }
    return 0;
}



/**
 * @brief   Flush TX FIFO
 *
 */
static void
ETH_FlushTXFIFO(void) {

    ETH->DMAOMR = ETH_DMAOMR_FTF;

    delay(ETH_DELAY_AFTERFLUSH);

    return;
}


/**
 * @brief   ETH Enable/Disable Transmission DMA
 */
///@{
void ETH_EnableTransmissionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_ST;
}

void ETH_DisableTransmissionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
}
///@}


/**
 * @brief   ETH Enable/Disable Reception DMA
 */
///@{
void ETH_EnableReceptionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_SR;
}

void ETH_DisableReceptionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_SR;
}
///@}


/**
 * @brief   ETH Enable/Disable Transmission MAC
 */
///@{
void ETH_EnableTransmissionMAC(void) {

    ETH->MACCR |= ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}

void ETH_DisableTransmissionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}

/**
 * @brief   ETH Enable/Disable Reception MAC
 */
///@{
void ETH_EnableReceptionMAC(void) {

    ETH->MACCR |= ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}

void ETH_DisableReceptionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}


////////////////// Status Functions /////////////////////////////////////////////////////////////

/**
 * @brief  Check link status and return if it up (connected)
 * 
 * @return int 
 */
int  ETH_IsConnected(void) {
int retries = ETH_RETRIES_LINK;
uint16_t value;

    MESSAGE("Is connected?\n");
    value = 0;
    do {
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        delay(ETH_DELAY_BETWEENTESTS);
    } while((retries-->0)&&((value&ETH_PHY_BSR_LINKUP)==0));

    message("Connected = %04X = ",value);
    value = (value&ETH_PHY_BSR_LINKUP)!=0;
    message(" %d\n",value);
    return value ;
}

/**
 * @brief   Check if link is up;
 * 
 * @brief   Alias for IsConnected
 * 
 * @return int 
 */
int  ETH_IsLinkUp(void) {

    return ETH_IsConnected();
}



/**
 * @brief   Return link status
 * 
 * @brief   Returns a merge of BCR and BSR registers of PHY
 * 
 * @return  higher 16 bits contains BCR and the lower 16 bits, BSR 
 */
unsigned ETH_GetLinkStatus(void) {
uint16_t bcr,bsr;

    ETH_ReadPHYRegister(ETH_PHY_BCR,&bcr);
    delay(ETH_DELAY_BETWEENTESTS);

    ETH_ReadPHYRegister(ETH_PHY_BSR,&bsr);
    delay(ETH_DELAY_BETWEENTESTS);

    return  (((uint32_t) bcr)<<16) | ((uint32_t) bsr);
}

///////////////// Register callback functions ////////////////////////////////////////////////////

/**
 * @brief   Register Callback functions
 *
 * @note    To unregister, set pointer to 0 or NULL
 */
void ETH_RegisterCallback(unsigned which, void (*pFunction)(unsigned) ) {

    switch(which) {
    case ETH_CALLBACK_FRAMERECEIVED:
        ETH_Callbacks.FrameReceived     = pFunction;
        break;
    case ETH_CALLBACK_FRAMETRANSMITTED:
        ETH_Callbacks.FrameTransmitted  = pFunction;
        break;
    case ETH_CALLBACK_ERRORDETECTED:
        ETH_Callbacks.ErrorDetected     = pFunction;
        break;
    case ETH_CALLBACK_LINKSTATUSCHANGED:
        ETH_Callbacks.LinkStatusChanged = pFunction;
    }

    return;
}

struct pyregisternames {
    int     index;
    char *  name;
} regtable[] = {
  {  0, "Basic Control" },
  {  1, "Basic Status" },
  {  2, "PHY Identifier 1" },
  {  3, "PHY Identifier 2" },
  {  4, "Auto Negotiation Advertisement" },
  {  5, "Auto Negotiation Partner Ability" },
  {  6, "Auto Negotiation Expansion" },
  {  7, "Auto Negotiation Next Page TX" },
  {  8, "Auto Negotiation Next Page RX" },
  { 13, "MMD Access Control" },
  { 14, "MMD Access Address/Data" },
  { 16, "EDPD NLP/Crossover Time*" },
  { 17, "Mode Control/Status*" },
  { 18, "Special Modes*" },
  { 24, "TDR Patterns/Delay Control*" },
  { 25, "TDR Control/Status*" },
  { 26, "Symbol Error Counter*" },
  { 27, "Special Control/Status Indications*" },
  { 28, "Cable Length*" },
  { 29, "Interrupt Source Flag*" },
  { 30, "Interrupt Mask*" },
  { 31, "PHY Special Control/Status" },
  { 0,  0 } /* END MARKER */
};

void ETH_PHYRegisterDump(void) {
struct pyregisternames *p = regtable;
uint16_t value;
#if 0
    while( p->name ) {
        ETH_ReadPHYRegister(p->index,&value);
        message("%35s: %04X\n",p->name,value);
        p++;
    }
#endif
}


/**
 * @brief   ETH_GetLinkInfo
 * 
 * @note    returns the link info
 * 
 */

static char const *linkinfo[] = {
    /* 000 */       "Not connected ?",
    /* 001 */       "10BaseT Half Duplex",
    /* 010 */       "100BaseT Half Duplex",
    /* 011 */       "Not connected?",
    /* 100 */       "Not connected ?",
    /* 101 */       "10BaseT Full Duplex",
    /* 110 */       "100BaseT Full Duplex",
    /* 111 */       "Not connected"
};

int
ETH_GetLinkInfo(void) {
uint16_t value;

    ETH_ReadPHYRegister(ETH_PHY_SCSR,&value);

    value >>= 2;
    value &= 0x7;
    return value;
}

char const *
ETH_GetLinkInfoString(void) {
uint16_t value;

    value = ETH_GetLinkInfo();
    return linkinfo[value];
}


/**
 * @brief   ETH_DumpDescriptors
 * 
 */
void ETH_DumpDescriptors(void) {
ETH_DMADescriptor *desc,*next;
char *buffer;

    desc = ETH_TXDescriptors;
    do {
        next = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        buffer = (char *) (desc->Buffer1Addr);
        message("TX descriptor = %p: next = %p buffer = %p\n",desc,next,buffer);
        desc = next;
    } while ( desc != ETH_TXDescriptors );

    desc = ETH_RXDescriptors;
    do {
        next = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        buffer = (char *) (desc->Buffer1Addr);
        message("RX descriptor = %p: next = %p buffer = %p\n",desc,next,buffer);
        desc = next;
    } while ( desc != ETH_RXDescriptors );
}